#### Pandas-DataFrame and series

Pandas is a powerful data manipulating library in python, widely used for data analysis and data cleaning. It provide two primary data structure: Series and DataFrame. A series is one -dimensional array-like object, while a dataFrame is a two-dimensional, size mutable, and potential heterogeneous tabular data structure with labeled axes (rows and columns).

In [1]:
!pip install pandas

Requirement already satisfied: pandas in d:\paidcourse\python\venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in d:\paidcourse\python\venv\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\paidcourse\python\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\paidcourse\python\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in d:\paidcourse\python\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\soumy\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [3]:
# series 
# A pandas series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table

import pandas as pd
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print("Series \n", series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
## create a series from dictionary
data = {'a':1, 'b':2, 'c':3}
series_dic = pd.Series(data)
print(series_dic)

a    1
b    2
c    3
dtype: int64

In [5]:
data = [10, 20 ,30]
index = ['a', 'b', 'c']
series = pd.Series(data,index=index)
print(series)

a    10
b    20
c    30
dtype: int64

In [6]:
## DataFrame
## create a Dataframe from a dictionary of list

data = {
    'Name':['krish', 'john', 'jack'],
    'Age' : [25, 30, 45],
    'City':['Bangalor', 'New York', 'Florida']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  krish   25  Bangalor
1   john   30  New York
2   jack   45   Florida
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['krish', 25, 'Bangalor'],
       ['john', 30, 'New York'],
       ['jack', 45, 'Florida']], dtype=object)

In [63]:
## Create a Data frame a list of Dictionary

data = [
    {'Name': 'Soumya', 'Age': 22, 'City': 'Roorkee'},
    {'Name': 'Krish', 'Age': 32, 'City': 'Bangalore'},
    {'Name': 'john', 'Age': 28, 'City': 'New York'}
]

df = pd.DataFrame(data)
print(df)

     Name  Age       City
0  Soumya   22    Roorkee
1   Krish   32  Bangalore
2    john   28   New York

In [23]:
df = pd.read_csv('airtravel.csv')
print(df)
print(df.head(5))

   Month   1958   1959   1960
0    JAN    340    360    417
1    FEB    318    342    391
2    MAR    362    406    419
3    APR    348    396    461
4    MAY    363    420    472
5    JUN    435    472    535
6    JUL    491    548    622
7    AUG    505    559    606
8    SEP    404    463    508
9    OCT    359    407    461
10   NOV    310    362    390
11   DEC    337    405    432
  Month   1958   1959   1960
0   JAN    340    360    417
1   FEB    318    342    391
2   MAR    362    406    419
3   APR    348    396    461
4   MAY    363    420    472

In [ ]:
df['Month']
print(type(df['Month']))

<class 'pandas.core.series.Series'>

In [28]:
df.loc[0]

Month    JAN
 1958    340
 1959    360
 1960    417
Name: 0, dtype: object

In [33]:
df.iloc[0][2]

C:\Users\soumy\AppData\Local\Temp\ipykernel_3520\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

np.int64(360)

In [34]:
## Accessing specific element
df['Month'][2]

'MAR'

In [37]:
df.at[1, 'Month']

'FEB'

In [38]:
df.at[2, 'Month']

'MAR'

In [39]:
## Accessing a specific element using iat
df.iat[2,2]

np.int64(406)

In [40]:
df

   Month   1958   1959   1960
0    JAN    340    360    417
1    FEB    318    342    391
2    MAR    362    406    419
3    APR    348    396    461
4    MAY    363    420    472
5    JUN    435    472    535
6    JUL    491    548    622
7    AUG    505    559    606
8    SEP    404    463    508
9    OCT    359    407    461
10   NOV    310    362    390
11   DEC    337    405    432

In [49]:
## Data Manipulation with DataFrame
df['Salary'] = [5000, 6000, 7000]
print(df)

     Name  Age       City  Salary
0  Soumya   22    Roorkee    5000
1   Krish   32  Bangalore    6000
2    john   28   New York    7000

In [54]:
# Remove a column
df.drop(columns='Salary', inplace=True)

In [55]:
df

     Name  Age       City
0  Soumya   22    Roorkee
1   Krish   32  Bangalore
2    john   28   New York

In [56]:
## Add age to column
df['Age']=df['Age'] +1

In [57]:
df

     Name  Age       City
0  Soumya   23    Roorkee
1   Krish   33  Bangalore
2    john   29   New York

In [60]:
df.drop(1, inplace=True)

In [61]:
df

   Name  Age      City
2  john   29  New York

In [64]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     5.033223
min    22.000000
25%    25.000000
50%    28.000000
75%    30.000000
max    32.000000